HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_regdef.h
/** \\brief  Boundary Flag Register, Group */
typedef struct _Ifx_VADC_G_BFL_Bits
{
    unsigned int BFL0:1;                    /**< \brief [0:0] Boundary Flag 0 (rh) */
    unsigned int BFL1:1;                    /**< \brief [1:1] Boundary Flag 1 (rh) */
    unsigned int BFL2:1;                    /**< \brief [2:2] Boundary Flag 2 (rh) */
    unsigned int BFL3:1;                    /**< \brief [3:3] Boundary Flag 3 (rh) */
    unsigned int reserved_4:4;              /**< \brief \internal Reserved */
    unsigned int BFA0:1;                    /**< \brief [8:8] Boundary Flag 0 Activation Select (rw) */
    unsigned int BFA1:1;                    /**< \brief [9:9] Boundary Flag 1 Activation Select (rw) */
    unsigned int BFA2:1;                    /**< \brief [10:10] Boundary Flag 2 Activation Select (rw) */
    unsigned int BFA3:1;                    /**< \brief [11:11] Boundary Flag 3 Activation Select (rw) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int BFI0:1;                    /**< \brief [16:16] Boundary Flag 0 Inversion Control (rw) */
    unsigned int BFI1:1;                    /**< \brief [17:17] Boundary Flag 1 Inversion Control (rw) */
    unsigned int BFI2:1;                    /**< \brief [18:18] Boundary Flag 2 Inversion Control (rw) */
    unsigned int BFI3:1;                    /**< \brief [19:19] Boundary Flag 3 Inversion Control (rw) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_VADC_G_BFL_Bits;

/** \\brief  Boundary Flag Control Register, Group */
typedef struct _Ifx_VADC_G_BFLC_Bits
{
    unsigned int BFM0:4;                    /**< \brief [3:0] Boundary Flag y Mode Control (rw) */
    unsigned int BFM1:4;                    /**< \brief [7:4] Boundary Flag y Mode Control (rw) */
    unsigned int BFM2:4;                    /**< \brief [11:8] Boundary Flag y Mode Control (rw) */
    unsigned int BFM3:4;                    /**< \brief [15:12] Boundary Flag y Mode Control (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_VADC_G_BFLC_Bits;

/** \\brief  Boundary Flag Node Pointer Register, Group */
typedef struct _Ifx_VADC_G_BFLNP_Bits
{
    unsigned int BFL0NP:4;                  /**< \brief [3:0] Boundary Flag y Node Pointer (rw) */
    unsigned int BFL1NP:4;                  /**< \brief [7:4] Boundary Flag y Node Pointer (rw) */
    unsigned int BFL2NP:4;                  /**< \brief [11:8] Boundary Flag y Node Pointer (rw) */
    unsigned int BFL3NP:4;                  /**< \brief [15:12] Boundary Flag y Node Pointer (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_VADC_G_BFLNP_Bits;

/** \\brief  Boundary Flag Software Register, Group */
typedef struct _Ifx_VADC_G_BFLS_Bits
{
    unsigned int BFC0:1;                    /**< \brief [0:0] Boundary Flag 0 Clear (w) */
    unsigned int BFC1:1;                    /**< \brief [1:1] Boundary Flag 1 Clear (w) */
    unsigned int BFC2:1;                    /**< \brief [2:2] Boundary Flag 2 Clear (w) */
    unsigned int BFC3:1;                    /**< \brief [3:3] Boundary Flag 3 Clear (w) */
    unsigned int reserved_4:12;             /**< \brief \internal Reserved */
    unsigned int BFS0:1;                    /**< \brief [16:16] Boundary Flag 0 Set (w) */
    unsigned int BFS1:1;                    /**< \brief [17:17] Boundary Flag 1 Set (w) */
    unsigned int BFS2:1;                    /**< \brief [18:18] Boundary Flag 2 Set (w) */
    unsigned int BFS3:1;                    /**< \brief [19:19] Boundary Flag 3 Set (w) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_VADC_G_BFLS_Bits;

/** \\brief  Boundary Select Register, Group */
typedef struct _Ifx_VADC_G_BOUND_Bits
{
    unsigned int BOUNDARY0:12;              /**< \brief [11:0] Boundary Value 0 for Limit Checking (rw) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int BOUNDARY1:12;              /**< \brief [27:16] Boundary Value 1 for Limit Checking (rw) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_VADC_G_BOUND_Bits;

/** \\brief  Channel Event Flag Clear Register, Group */
typedef struct _Ifx_VADC_G_CEFCLR_Bits
{
    unsigned int CEV0:1;                    /**< \brief [0:0] Clear Channel Event for Channel 0 (w) */
    unsigned int CEV1:1;                    /**< \brief [1:1] Clear Channel Event for Channel 1 (w) */
    unsigned int CEV2:1;                    /**< \brief [2:2] Clear Channel Event for Channel 2 (w) */
    unsigned int CEV3:1;                    /**< \brief [3:3] Clear Channel Event for Channel 3 (w) */
    unsigned int CEV4:1;                    /**< \brief [4:4] Clear Channel Event for Channel 4 (w) */
    unsigned int CEV5:1;                    /**< \brief [5:5] Clear Channel Event for Channel 5 (w) */
    unsigned int CEV6:1;                    /**< \brief [6:6] Clear Channel Event for Channel 6 (w) */
    unsigned int CEV7:1;                    /**< \brief [7:7] Clear Channel Event for Channel 7 (w) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_VADC_G_CEFCLR_Bits;

/** \\brief  Channel Event Flag Register, Group */
typedef struct _Ifx_VADC_G_CEFLAG_Bits
{
    unsigned int CEV0:1;                    /**< \brief [0:0] Channel Event for Channel 0 (rwh) */
    unsigned int CEV1:1;                    /**< \brief [1:1] Channel Event for Channel 1 (rwh) */
    unsigned int CEV2:1;                    /**< \brief [2:2] Channel Event for Channel 2 (rwh) */
    unsigned int CEV3:1;                    /**< \brief [3:3] Channel Event for Channel 3 (rwh) */
    unsigned int CEV4:1;                    /**< \brief [4:4] Channel Event for Channel 4 (rwh) */
    unsigned int CEV5:1;                    /**< \brief [5:5] Channel Event for Channel 5 (rwh) */
    unsigned int CEV6:1;                    /**< \brief [6:6] Channel Event for Channel 6 (rwh) */
    unsigned int CEV7:1;                    /**< \brief [7:7] Channel Event for Channel 7 (rwh) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_VADC_G_CEFLAG_Bits;

/** \\brief  Channel Event Node Pointer Register 0, Group */
typedef struct _Ifx_VADC_G_CEVNP0_Bits
{
    unsigned int CEV0NP:4;                  /**< \brief [3:0] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV1NP:4;                  /**< \brief [7:4] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV2NP:4;                  /**< \brief [11:8] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV3NP:4;                  /**< \brief [15:12] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV4NP:4;                  /**< \brief [19:16] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV5NP:4;                  /**< \brief [23:20] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV6NP:4;                  /**< \brief [27:24] Service Request Node Pointer Channel Event i (rw) */
    unsigned int CEV7NP:4;                  /**< \brief [31:28] Service Request Node Pointer Channel Event i (rw) */
} Ifx_VADC_G_CEVNP0_Bits;

/** \\brief  Channel Assignment Register, Group */
typedef struct _Ifx_VADC_G_CHASS_Bits
{
    unsigned int ASSCH0:1;                  /**< \brief [0:0] Assignment for Channel 0 (rw) */
    unsigned int ASSCH1:1;                  /**< \brief [1:1] Assignment for Channel 1 (rw) */
    unsigned int ASSCH2:1;                  /**< \brief [2:2] Assignment for Channel 2 (rw) */
    unsigned int ASSCH3:1;                  /**< \brief [3:3] Assignment for Channel 3 (rw) */
    unsigned int ASSCH4:1;                  /**< \brief [4:4] Assignment for Channel 4 (rw) */
    unsigned int ASSCH5:1;                  /**< \brief [5:5] Assignment for Channel 5 (rw) */
    unsigned int ASSCH6:1;                  /**< \brief [6:6] Assignment for Channel 6 (rw) */
    unsigned int ASSCH7:1;                  /**< \brief [7:7] Assignment for Channel 7 (rw) */
    unsigned int ASSCH8:1;                  /**< \brief [8:8] Assignment for Channel 8 (rw) */
    unsigned int ASSCH9:1;                  /**< \brief [9:9] Assignment for Channel 9 (rw) */
    unsigned int ASSCH10:1;                 /**< \brief [10:10] Assignment for Channel 10 (rw) */
    unsigned int ASSCH11:1;                 /**< \brief [11:11] Assignment for Channel 11 (rw) */
    unsigned int ASSCH12:1;                 /**< \brief [12:12] Assignment for Channel 12 (rw) */
    unsigned int ASSCH13:1;                 /**< \brief [13:13] Assignment for Channel 13 (rw) */
    unsigned int ASSCH14:1;                 /**< \brief [14:14] Assignment for Channel 14 (rw) */
    unsigned int ASSCH15:1;                 /**< \brief [15:15] Assignment for Channel 15 (rw) */
    unsigned int ASSCH16:1;                 /**< \brief [16:16] Assignment for Channel 16 (rw) */
    unsigned int ASSCH17:1;                 /**< \brief [17:17] Assignment for Channel 17 (rw) */
    unsigned int ASSCH18:1;                 /**< \brief [18:18] Assignment for Channel 18 (rw) */
    unsigned int ASSCH19:1;                 /**< \brief [19:19] Assignment for Channel 19 (rw) */
    unsigned int ASSCH20:1;                 /**< \brief [20:20] Assignment for Channel 20 (rw) */
    unsigned int ASSCH21:1;                 /**< \brief [21:21] Assignment for Channel 21 (rw) */
    unsigned int ASSCH22:1;                 /**< \brief [22:22] Assignment for Channel 22 (rw) */
    unsigned int ASSCH23:1;                 /**< \brief [23:23] Assignment for Channel 23 (rw) */
    unsigned int ASSCH24:1;                 /**< \brief [24:24] Assignment for Channel 24 (rw) */
    unsigned int ASSCH25:1;                 /**< \brief [25:25] Assignment for Channel 25 (rw) */
    unsigned int ASSCH26:1;                 /**< \brief [26:26] Assignment for Channel 26 (rw) */
    unsigned int ASSCH27:1;                 /**< \brief [27:27] Assignment for Channel 27 (rw) */
    unsigned int ASSCH28:1;                 /**< \brief [28:28] Assignment for Channel 28 (rw) */
    unsigned int ASSCH29:1;                 /**< \brief [29:29] Assignment for Channel 29 (rw) */
    unsigned int ASSCH30:1;                 /**< \brief [30:30] Assignment for Channel 30 (rw) */
    unsigned int ASSCH31:1;                 /**< \brief [31:31] Assignment for Channel 31 (rw) */
} Ifx_VADC_G_CHASS_Bits;

/** \\brief  External Multiplexer Control Register, Group x */
typedef struct _Ifx_VADC_G_EMUXCTR_Bits
{
    unsigned int EMUXSET:3;                 /**< \brief [2:0] External Multiplexer Start Selection (rw) */
    unsigned int reserved_3:5;              /**< \brief \internal Reserved */
    unsigned int EMUXACT:3;                 /**< \brief [10:8] External Multiplexer Actual Selection (rh) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int EMUXCH:10;                 /**< \brief [25:16] External Multiplexer Channel Select (rw) */
    unsigned int EMUXMODE:2;                /**< \brief [27:26] External Multiplexer Mode (rw) */
    unsigned int EMXCOD:1;                  /**< \brief [28:28] External Multiplexer Coding Scheme (rw) */
    unsigned int EMXST:1;                   /**< \brief [29:29] External Multiplexer Sample Time Control (rw) */
    unsigned int EMXCSS:1;                  /**< \brief [30:30] External Multiplexer Channel Selection Style (r) */
    unsigned int EMXWC:1;                   /**< \brief [31:31] Write Control for EMUX Configuration (w) */
} Ifx_VADC_G_EMUXCTR_Bits;

/** \\brief  Queue 0 Register 0, Group */
typedef struct _Ifx_VADC_G_Q0R0_Bits
{
    unsigned int REQCHNR:5;                 /**< \brief [4:0] Request Channel Number (rh) */
    unsigned int RF:1;                      /**< \brief [5:5] Refill (rh) */
    unsigned int ENSI:1;                    /**< \brief [6:6] Enable Source Interrupt (rh) */
    unsigned int EXTR:1;                    /**< \brief [7:7] External Trigger (rh) */
    unsigned int V:1;                       /**< \brief [8:8] Request Channel Number Valid (rh) */
    unsigned int reserved_9:23;             /**< \brief \internal Reserved */
} Ifx_VADC_G_Q0R0_Bits;

