HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_regdef.h
/** \\brief  Calibration Control Register */
typedef struct _Ifx_VADC_SHS2_CALCTR_Bits
{
    unsigned int CALORD:1;                  /**< \brief [0:0] Calibration Order (rw) */
    unsigned int reserved_1:1;              /**< \brief \internal Reserved */
    unsigned int ARCDIS:1;                  /**< \brief [2:2] Alternate Reference Calibration Disable (rw) */
    unsigned int ARCH:1;                    /**< \brief [3:3] Alternate Reference Channel (rw) */
    unsigned int AREFDEF:3;                 /**< \brief [6:4] Alternate Reference Definition (rw) */
    unsigned int ARM:1;                     /**< \brief [7:7] Alternate Reference Mode (rw) */
    unsigned int CALGNSTC:6;                /**< \brief [13:8] Gain Calibration Sample Time Control (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int SUCALVAL:7;                /**< \brief [22:16] Startup Calibration Cycles (rw) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int CALMAX:6;                  /**< \brief [29:24] Calibration Maximum Timing (rw) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int SUCAL:1;                   /**< \brief [31:31] Start-Up Calibration (w) */
} Ifx_VADC_SHS2_CALCTR_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_VADC_SHS2_ID_Bits
{
    unsigned int MOD_REV:8;                 /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MOD_TYPE:8;                /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_VADC_SHS2_ID_Bits;

/** \\brief  SHS Configuration Register */
typedef struct _Ifx_VADC_SHS2_SHSCFG_Bits
{
    unsigned int DIVS:4;                    /**< \brief [3:0] Divider Factor for the SHS Clock (rw) */
    unsigned int reserved_4:1;              /**< \brief \internal Reserved */
    unsigned int SYNSH23:2;                 /**< \brief [6:5] Synchronization of Sample&Hold Units xy (rw) */
    unsigned int SYNSH01:2;                 /**< \brief [8:7] Synchronization of Sample&Hold Units xy (rw) */
    unsigned int reserved_9:1;              /**< \brief \internal Reserved */
    unsigned int AREF:2;                    /**< \brief [11:10] Analog Reference Voltage Selection (rw) */
    unsigned int ANOFF:1;                   /**< \brief [12:12] Analog Converter Power Down Force (rw) */
    unsigned int reserved_13:1;             /**< \brief \internal Reserved */
    unsigned int ANRDY:1;                   /**< \brief [14:14] Analog Converter Ready (rh) */
    unsigned int SCWC:1;                    /**< \brief [15:15] Write Control for SHS Configuration (w) */
    unsigned int SP0:1;                     /**< \brief [16:16] Sample Pending on S&H Unit x (rh) */
    unsigned int SP1:1;                     /**< \brief [17:17] Sample Pending on S&H Unit x (rh) */
    unsigned int SP2:1;                     /**< \brief [18:18] Sample Pending on S&H Unit x (rh) */
    unsigned int SP3:1;                     /**< \brief [19:19] Sample Pending on S&H Unit x (rh) */
    unsigned int reserved_20:4;             /**< \brief \internal Reserved */
    unsigned int TC:4;                      /**< \brief [27:24] Test Control (rw) */
    unsigned int STATE:4;                   /**< \brief [31:28] Current State of Sequencer (rh) */
} Ifx_VADC_SHS2_SHSCFG_Bits;

/** \\brief  Stepper Configuration Register */
typedef struct _Ifx_VADC_SHS2_STEPCFG_Bits
{
    unsigned int KSEL0:3;                   /**< \brief [2:0] Kernel Select (rw) */
    unsigned int SEN0:1;                    /**< \brief [3:3] Step x Enable (rw) */
    unsigned int KSEL1:3;                   /**< \brief [6:4] Kernel Select (rw) */
    unsigned int SEN1:1;                    /**< \brief [7:7] Step x Enable (rw) */
    unsigned int KSEL2:3;                   /**< \brief [10:8] Kernel Select (rw) */
    unsigned int SEN2:1;                    /**< \brief [11:11] Step x Enable (rw) */
    unsigned int KSEL3:3;                   /**< \brief [14:12] Kernel Select (rw) */
    unsigned int SEN3:1;                    /**< \brief [15:15] Step x Enable (rw) */
    unsigned int KSEL4:3;                   /**< \brief [18:16] Kernel Select (rw) */
    unsigned int SEN4:1;                    /**< \brief [19:19] Step x Enable (rw) */
    unsigned int KSEL5:3;                   /**< \brief [22:20] Kernel Select (rw) */
    unsigned int SEN5:1;                    /**< \brief [23:23] Step x Enable (rw) */
    unsigned int KSEL6:3;                   /**< \brief [26:24] Kernel Select (rw) */
    unsigned int SEN6:1;                    /**< \brief [27:27] Step x Enable (rw) */
    unsigned int KSEL7:3;                   /**< \brief [30:28] Kernel Select (rw) */
    unsigned int SEN7:1;                    /**< \brief [31:31] Step x Enable (rw) */
} Ifx_VADC_SHS2_STEPCFG_Bits;

/** \\brief  Calibration Control Register */
typedef struct _Ifx_VADC_SHS_CALCTR_Bits
{
    unsigned int CALORD:1;                  /**< \brief [0:0] Calibration Order (rw) */
    unsigned int reserved_1:1;              /**< \brief \internal Reserved */
    unsigned int ARCDIS:1;                  /**< \brief [2:2] Alternate Reference Calibration Disable (rw) */
    unsigned int ARCH:1;                    /**< \brief [3:3] Alternate Reference Channel (rw) */
    unsigned int AREFDEF:3;                 /**< \brief [6:4] Alternate Reference Definition (rw) */
    unsigned int ARM:1;                     /**< \brief [7:7] Alternate Reference Mode (rw) */
    unsigned int CALGNSTC:6;                /**< \brief [13:8] Gain Calibration Sample Time Control (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int SUCALVAL:7;                /**< \brief [22:16] Startup Calibration Cycles (rw) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int CALMAX:6;                  /**< \brief [29:24] Calibration Maximum Timing (rw) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int SUCAL:1;                   /**< \brief [31:31] Start-Up Calibration (w) */
} Ifx_VADC_SHS_CALCTR_Bits;

/** \\brief  Gain Calibration Control $2 */
typedef struct _Ifx_VADC_SHS_CALGC_Bits
{
    unsigned int CALGNVALS:14;              /**< \brief [13:0] Gain Calibration Value, Standard Reference (rwh) */
    unsigned int reserved_14:1;             /**< \brief \internal Reserved */
    unsigned int GNSWC:1;                   /**< \brief [15:15] Gain Calibration Write Control, Standard (w) */
    unsigned int CALGNVALA:14;              /**< \brief [29:16] Gain Calibration Value, Alternate Reference (rwh) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int GNAWC:1;                   /**< \brief [31:31] Gain Calibration Write Control, Alternate (w) */
} Ifx_VADC_SHS_CALGC_Bits;

