HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_regdef.h
/** \\brief  Offset Calibration Control $2 */
typedef struct _Ifx_VADC_SHS_CALOC_Bits
{
    unsigned int CALOFFVAL0:7;              /**< \brief [6:0] Offset Calibration Value (rwh) */
    unsigned int reserved_7:8;              /**< \brief \internal Reserved */
    unsigned int OFFWC:1;                   /**< \brief [15:15] Offset Calibration Write Control (w) */
    unsigned int reserved_16:15;            /**< \brief \internal Reserved */
    unsigned int DISCAL:1;                  /**< \brief [31:31] Disable Calibration (rw) */
} Ifx_VADC_SHS_CALOC_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_VADC_SHS_ID_Bits
{
    unsigned int MOD_REV:8;                 /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MOD_TYPE:8;                /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_VADC_SHS_ID_Bits;

/** \\brief  SHS Configuration Register */
typedef struct _Ifx_VADC_SHS_SHSCFG_Bits
{
    unsigned int DIVS:4;                    /**< \brief [3:0] Divider Factor for the SHS Clock (rw) */
    unsigned int reserved_4:1;              /**< \brief \internal Reserved */
    unsigned int SYNSH23:2;                 /**< \brief [6:5] Synchronization of Sample&Hold Units xy (rw) */
    unsigned int SYNSH01:2;                 /**< \brief [8:7] Synchronization of Sample&Hold Units xy (rw) */
    unsigned int reserved_9:1;              /**< \brief \internal Reserved */
    unsigned int AREF:2;                    /**< \brief [11:10] Analog Reference Voltage Selection (rw) */
    unsigned int ANOFF:1;                   /**< \brief [12:12] Analog Converter Power Down Force (rw) */
    unsigned int reserved_13:1;             /**< \brief \internal Reserved */
    unsigned int ANRDY:1;                   /**< \brief [14:14] Analog Converter Ready (rh) */
    unsigned int SCWC:1;                    /**< \brief [15:15] Write Control for SHS Configuration (w) */
    unsigned int SP0:1;                     /**< \brief [16:16] Sample Pending on S&H Unit x (rh) */
    unsigned int SP1:1;                     /**< \brief [17:17] Sample Pending on S&H Unit x (rh) */
    unsigned int SP2:1;                     /**< \brief [18:18] Sample Pending on S&H Unit x (rh) */
    unsigned int SP3:1;                     /**< \brief [19:19] Sample Pending on S&H Unit x (rh) */
    unsigned int reserved_20:4;             /**< \brief \internal Reserved */
    unsigned int TC:4;                      /**< \brief [27:24] Test Control (rw) */
    unsigned int STATE:4;                   /**< \brief [31:28] Current State of Sequencer (rh) */
} Ifx_VADC_SHS_SHSCFG_Bits;

/** \\brief  Stepper Configuration Register */
typedef struct _Ifx_VADC_SHS_STEPCFG_Bits
{
    unsigned int KSEL0:3;                   /**< \brief [2:0] Kernel Select (rw) */
    unsigned int SEN0:1;                    /**< \brief [3:3] Step x Enable (rw) */
    unsigned int KSEL1:3;                   /**< \brief [6:4] Kernel Select (rw) */
    unsigned int SEN1:1;                    /**< \brief [7:7] Step x Enable (rw) */
    unsigned int KSEL2:3;                   /**< \brief [10:8] Kernel Select (rw) */
    unsigned int SEN2:1;                    /**< \brief [11:11] Step x Enable (rw) */
    unsigned int KSEL3:3;                   /**< \brief [14:12] Kernel Select (rw) */
    unsigned int SEN3:1;                    /**< \brief [15:15] Step x Enable (rw) */
    unsigned int KSEL4:3;                   /**< \brief [18:16] Kernel Select (rw) */
    unsigned int SEN4:1;                    /**< \brief [19:19] Step x Enable (rw) */
    unsigned int KSEL5:3;                   /**< \brief [22:20] Kernel Select (rw) */
    unsigned int SEN5:1;                    /**< \brief [23:23] Step x Enable (rw) */
    unsigned int KSEL6:3;                   /**< \brief [26:24] Kernel Select (rw) */
    unsigned int SEN6:1;                    /**< \brief [27:27] Step x Enable (rw) */
    unsigned int KSEL7:3;                   /**< \brief [30:28] Kernel Select (rw) */
    unsigned int SEN7:1;                    /**< \brief [31:31] Step x Enable (rw) */
} Ifx_VADC_SHS_STEPCFG_Bits;

/** \\brief  Timing Configuration $2 */
typedef struct _Ifx_VADC_SHS_TIMCFG_Bits
{
    unsigned int AT:1;                      /**< \brief [0:0] Accelerated Timing (rw) */
    unsigned int reserved_1:3;              /**< \brief \internal Reserved */
    unsigned int FCRT:4;                    /**< \brief [7:4] Fast Compare Mode Response Time (rw) */
    unsigned int SST:6;                     /**< \brief [13:8] Short Sample Time (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int TGEN:14;                   /**< \brief [29:16] Timing Generator (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_VADC_SHS_TIMCFG_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Vadc_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_ACCEN0_Bits B;
} Ifx_VADC_ACCEN0;

/** \\brief  Access Protection Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_ACCPROT0_Bits B;
} Ifx_VADC_ACCPROT0;

/** \\brief  Access Protection Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_ACCPROT1_Bits B;
} Ifx_VADC_ACCPROT1;

/** \\brief  Background Request Source Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_VADC_BRSCTRL_Bits B;
} Ifx_VADC_BRSCTRL;

